Roju667/cmsis_stm32f103c6t6_myHAL/Inc/devices/Inc/ILI9341.h
/*
 * ILI9341.h
 *
 *  Created on: Oct 11, 2021
 *      Author: ROJEK
 */

#ifndef INC_ILI9341_H_
#define INC_ILI9341_H_

#include "stm32f103xx_gpio.h"
#include "stm32f103xx_spi.h"

// Pins
#define ILI9341_USE_HW_RESET 1
#define ILI9341_USE_CS 1
#define ILI9341_SPI_TIMEOUT 1000
#define ILI9341_ROTATION 1 // 0 - 0 deg, 1 - 90 deg, 2 - 180 deg, 270 deg

#define TFT_CS_GPIO_Port GPIOB
#define TFT_CS_Pin GPIO_PIN_11

#define TFT_DC_GPIO_Port GPIOB
#define TFT_DC_Pin GPIO_PIN_10

#define TFT_RST_GPIO_Port GPIOB
#define TFT_RST_Pin GPIO_PIN_1

#define ILI9341_CS_LOW                                                         \
  md_gpio_write_pin(TFT_CS_GPIO_Port, TFT_CS_Pin, GPIO_PIN_RESET)
#define ILI9341_CS_HIGH                                                        \
  md_gpio_write_pin(TFT_CS_GPIO_Port, TFT_CS_Pin, GPIO_PIN_SET)

#define ILI9341_DC_LOW                                                         \
  md_gpio_write_pin(TFT_DC_GPIO_Port, TFT_DC_Pin, GPIO_PIN_RESET)
#define ILI9341_DC_HIGH                                                        \
  md_gpio_write_pin(TFT_DC_GPIO_Port, TFT_DC_Pin, GPIO_PIN_SET)

#define ILI9341_RST_LOW                                                        \
  md_gpio_write_pin(TFT_RST_GPIO_Port, TFT_RST_Pin, GPIO_PIN_RESET)
#define ILI9341_RST_HIGH                                                       \
  md_gpio_write_pin(TFT_RST_GPIO_Port, TFT_RST_Pin, GPIO_PIN_SET)

// Rotation stuff
#define MADCTL_MY 0x80  ///< Bottom to top
#define MADCTL_MX 0x40  ///< Right to left
#define MADCTL_MV 0x20  ///< Reverse Mode
#define MADCTL_ML 0x10  ///< LCD refresh Bottom to top
#define MADCTL_RGB 0x00 ///< Red-Green-Blue pixel order
#define MADCTL_BGR 0x08 ///< Blue-Green-Red pixel order
#define MADCTL_MH 0x04  ///< LCD refresh right to left

#if (ILI9341_ROTATION == 0) || (ILI9341_ROTATION == 2)
#define ILI9341_TFTWIDTH 240  ///< ILI9341 max TFT width
#define ILI9341_TFTHEIGHT 320 ///< ILI9341 max TFT height
#elif (ILI9341_ROTATION == 1) || (ILI9341_ROTATION == 3)
#define ILI9341_TFTWIDTH 320  ///< ILI9341 max TFT width
#define ILI9341_TFTHEIGHT 240 ///< ILI9341 max TFT height
#endif

#define ILI9341_NOP 0x00     ///< No-op register
#define ILI9341_SWRESET 0x01 ///< Software reset register
#define ILI9341_RDDID 0x04   ///< Read display identification information
#define ILI9341_RDDST 0x09   ///< Read Display Status

#define ILI9341_SLPIN 0x10  ///< Enter Sleep Mode
#define ILI9341_SLPOUT 0x11 ///< Sleep Out
#define ILI9341_PTLON 0x12  ///< Partial Mode ON
#define ILI9341_NORON 0x13  ///< Normal Display Mode ON

#define ILI9341_RDMODE 0x0A     ///< Read Display Power Mode
#define ILI9341_RDMADCTL 0x0B   ///< Read Display MADCTL
#define ILI9341_RDPIXFMT 0x0C   ///< Read Display Pixel Format
#define ILI9341_RDIMGFMT 0x0D   ///< Read Display Image Format
#define ILI9341_RDSELFDIAG 0x0F ///< Read Display Self-Diagnostic Result

#define ILI9341_INVOFF 0x20   ///< Display Inversion OFF
#define ILI9341_INVON 0x21    ///< Display Inversion ON
#define ILI9341_GAMMASET 0x26 ///< Gamma Set
#define ILI9341_DISPOFF 0x28  ///< Display OFF
#define ILI9341_DISPON 0x29   ///< Display ON

#define ILI9341_CASET 0x2A ///< Column Address Set
#define ILI9341_PASET 0x2B ///< Page Address Set
#define ILI9341_RAMWR 0x2C ///< Memory Write
#define ILI9341_RAMRD 0x2E ///< Memory Read

#define ILI9341_PTLAR 0x30    ///< Partial Area
#define ILI9341_VSCRDEF 0x33  ///< Vertical Scrolling Definition
#define ILI9341_MADCTL 0x36   ///< Memory Access Control
#define ILI9341_VSCRSADD 0x37 ///< Vertical Scrolling Start Address
#define ILI9341_PIXFMT 0x3A   ///< COLMOD: Pixel Format Set

#define ILI9341_FRMCTR1                                                        \
  0xB1 ///< Frame Rate Control (In Normal Mode/Full Colors)
#define ILI9341_FRMCTR2 0xB2 ///< Frame Rate Control (In Idle Mode/8 colors)
#define ILI9341_FRMCTR3                                                        \
  0xB3 ///< Frame Rate control (In Partial Mode/Full Colors)
#define ILI9341_INVCTR 0xB4  ///< Display Inversion Control
#define ILI9341_DFUNCTR 0xB6 ///< Display Function Control

#define ILI9341_PWCTR1 0xC0 ///< Power Control 1
#define ILI9341_PWCTR2 0xC1 ///< Power Control 2
#define ILI9341_PWCTR3 0xC2 ///< Power Control 3
#define ILI9341_PWCTR4 0xC3 ///< Power Control 4
#define ILI9341_PWCTR5 0xC4 ///< Power Control 5
#define ILI9341_VMCTR1 0xC5 ///< VCOM Control 1
#define ILI9341_VMCTR2 0xC7 ///< VCOM Control 2

#define ILI9341_RDID1 0xDA ///< Read ID 1
#define ILI9341_RDID2 0xDB ///< Read ID 2
#define ILI9341_RDID3 0xDC ///< Read ID 3
#define ILI9341_RDID4 0xDD ///< Read ID 4

#define ILI9341_GMCTRP1 0xE0 ///< Positive Gamma Correction
#define ILI9341_GMCTRN1 0xE1 ///< Negative Gamma Correction
//#define ILI9341_PWCTR6     0xFC

// Color definitions
#define ILI9341_BLACK 0x0000       ///<   0,   0,   0
#define ILI9341_NAVY 0x000F        ///<   0,   0, 123
#define ILI9341_DARKGREEN 0x03E0   ///<   0, 125,   0
#define ILI9341_DARKCYAN 0x03EF    ///<   0, 125, 123
#define ILI9341_MAROON 0x7800      ///< 123,   0,   0
#define ILI9341_PURPLE 0x780F      ///< 123,   0, 123
#define ILI9341_OLIVE 0x7BE0       ///< 123, 125,   0
#define ILI9341_LIGHTGREY 0xC618   ///< 198, 195, 198
#define ILI9341_DARKGREY 0x7BEF    ///< 123, 125, 123
#define ILI9341_BLUE 0x001F        ///<   0,   0, 255
#define ILI9341_GREEN 0x07E0       ///<   0, 255,   0
#define ILI9341_CYAN 0x07FF        ///<   0, 255, 255
#define ILI9341_RED 0xF800         ///< 255,   0,   0
#define ILI9341_MAGENTA 0xF81F     ///< 255,   0, 255
#define ILI9341_YELLOW 0xFFE0      ///< 255, 255,   0
#define ILI9341_WHITE 0xFFFF       ///< 255, 255, 255
#define ILI9341_ORANGE 0xFD20      ///< 255, 165,   0
#define ILI9341_GREENYELLOW 0xAFE5 ///< 173, 255,  41
#define ILI9341_PINK 0xFC18        ///< 255, 130, 198

void ILI9341_Init(spi_handle_t *hspi);
void ILI9341_WritePixel(int16_t x, int16_t y, uint16_t color);
void ILI9341_ClearDisplay(uint16_t color);
void ILI9341_DrawImage(int x, int y, const uint8_t *img, uint16_t w,
                       uint16_t h);
void ILI9341_SetRotation(uint8_t Rotation);
void ILI9341_ClearArea(uint16_t color, uint16_t start_x, uint16_t start_y,
                       uint16_t width, uint16_t height);

#endif /* INC_ILI9341_H_ */
